src/InformationRegisters/Scan_ДетализацияПлановыхДанных/Scan_ДетализацияПлановыхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДетализацияПлановыхДанных</name>
  <resources>
    <name>SLA</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MZ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MS</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BusChassis</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Engines</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Buses</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>BodybuiltUnits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Jenty</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>TruckOnTruckDelivery</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>JockeyTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>GenSetsTransportation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVehicles</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>QuantityOfVisits</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AcceptanceHandoverDemoTestRent</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AdministrationOfVehiclesSales</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДетализацияПлановыхДанных/Forms/ФормаЗаписи/Module.bsl
// rarus tenkam 02.03.2018 mantis 9066 +++ 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	ТекущийОбъект.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураОтбора = Новый Структура("Год", Запись.Год);
	СтруктураОтбора.Вставить("НомерНедели", Запись.НомерНедели);
	СтруктураДанных = РегистрыСведений.Scan_ДетализацияПлановыхДанных.Получить(СтруктураОтбора);
	
	ТекТабЗнч = СтруктураДанных.SLA.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			SLA = SLA + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	ТекТабЗнч = СтруктураДанных.MZ.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			MZ = MZ + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.MS.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			MS = MS + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.BusChassis.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			BusChassis = BusChassis + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.Engines.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			Engines = Engines + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.Buses.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			Buses = Buses + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.BodybuiltUnits.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			BodybuiltUnits = BodybuiltUnits + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.Jenty.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			Jenty = Jenty + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.TruckOnTruckDelivery.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			TruckOnTruckDelivery = TruckOnTruckDelivery + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.JockeyTransportation.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			JockeyTransportation = JockeyTransportation + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.GenSetsTransportation.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			GenSetsTransportation = GenSetsTransportation + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.QuantityOfVehicles.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			QuantityOfVehicles = QuantityOfVehicles + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;             	
	
	ТекТабЗнч = СтруктураДанных.QuantityOfVisits.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			QuantityOfVisits = QuantityOfVisits + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;	
	
	ТекТабЗнч = СтруктураДанных.AcceptanceHandoverDemoTestRent.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			AcceptanceHandoverDemoTestRent = AcceptanceHandoverDemoTestRent + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;
	
	ТекТабЗнч = СтруктураДанных.AdministrationOfVehiclesSales.Получить();
	Если ТекТабЗнч <> Неопределено Тогда
		Для Каждого ТекСтрока Из ТекТабЗнч Цикл
			AdministrationOfVehiclesSales = AdministrationOfVehiclesSales + ТекСтрока.Значение + Символы.ПС;
		КонецЦикла;		
	КонецЕсли;    	
	
КонецПроцедуры



// rarus tenkam 02.03.2018 mantis 9066 ---
